In [1]:
import pandas as pd

In [7]:
mydata=pd.DataFrame({'Name':['E','A','C','B','D'],
              'MATH':[17,12,16,11,9],
              'SCIENEC':[21,24,22,20,23]})

mydata

  Name  MATH  SCIENEC
0    E    17       21
1    A    12       24
2    C    16       22
3    B    11       20
4    D     9       23

In [16]:
res=mydata.groupby('Name')
print(res)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002D332C1DC90>

In [19]:
for i in res:
    print()
    print(i)
    print()

('A',   Name  MATH  SCIENEC
1    A    12       24)


('B',   Name  MATH  SCIENEC
3    B    11       20)


('C',   Name  MATH  SCIENEC
2    C    16       22)


('D',   Name  MATH  SCIENEC
4    D     9       23)


('E',   Name  MATH  SCIENEC
0    E    17       21)

In [20]:
res.get_group('A')

  Name  MATH  SCIENEC
1    A    12       24

In [23]:
res.min()
res.max()

      MATH  SCIENEC
Name
A       12       24
B       11       20
C       16       22
D        9       23
E       17       21

In [24]:
#CONVERTING THE GROUP BY RESULT INTO LIST-

list(res)

[('A',
    Name  MATH  SCIENEC
  1    A    12       24),
 ('B',
    Name  MATH  SCIENEC
  3    B    11       20),
 ('C',
    Name  MATH  SCIENEC
  2    C    16       22),
 ('D',
    Name  MATH  SCIENEC
  4    D     9       23),
 ('E',
    Name  MATH  SCIENEC
  0    E    17       21)]